# HelixGraph - Neo4j Cypher Queries

This notebook contains useful Cypher queries to explore and analyze the HelixGraph database.

## Setup - Connect to Neo4j

In [1]:
# Set up project path
import sys
import os

project_root = os.path.abspath(os.path.join(os.getcwd(), '..'))
if project_root not in sys.path:
    sys.path.insert(0, project_root)

from dotenv import load_dotenv
from neo4j import GraphDatabase
import pandas as pd

# Load environment variables
load_dotenv(os.path.join(project_root, '.env'))

# Neo4j connection
NEO4J_URI = os.getenv('NEO4J_URI')
NEO4J_USER = os.getenv('NEO4J_USER')
NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')

driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USER, NEO4J_PASSWORD))

def run_query(query, params=None):
    """Execute a Cypher query and return results as a DataFrame"""
    with driver.session() as session:
        result = session.run(query, params or {})
        return pd.DataFrame([record.data() for record in result])

print("✓ Connected to Neo4j")
print(f"  URI: {NEO4J_URI}")

✓ Connected to Neo4j
  URI: neo4j+s://561f8654.databases.neo4j.io

## 1. Database Overview

### Total Node and Relationship Counts

In [2]:
query = """
MATCH (n) 
RETURN count(n) AS total_nodes;
"""

result = run_query(query)
print(f"Total Nodes: {result['total_nodes'][0]:,}")
result

Total Nodes: 5,310

   total_nodes
0         5310

In [3]:
query = """
MATCH ()-[r]->() 
RETURN count(r) AS total_relationships;
"""

result = run_query(query)
print(f"Total Relationships: {result['total_relationships'][0]:,}")
result

Total Relationships: 20,035

   total_relationships
0                20035

### Node Count by Label

In [4]:
query = """
MATCH (n)
UNWIND labels(n) AS label
RETURN label, count(*) AS node_count
ORDER BY node_count DESC;
"""

result = run_query(query)
print("Node counts by label:")
result

Node counts by label:

                 label  node_count
0        CommerceOrder        1828
1         SupplierRisk         960
2              Invoice         674
3    MarketingCampaign         600
4        PurchaseOrder         480
5             Supplier         240
6             Employee         200
7      ProductCategory         124
8              Product         120
9                Skill          50
10               Brand          10
11    MarketingChannel           8
12  MarketingObjective           5
13        MarketingKPI           5
14          Department           3
15            Location           3

### Relationship Count by Type

In [5]:
query = """
MATCH ()-[r]->()
RETURN type(r) AS relationship_type, count(r) AS rel_count
ORDER BY rel_count DESC;
"""

result = run_query(query)
print("Relationship counts by type:")
result

Relationship counts by type:

     relationship_type  rel_count
0           KPI_RESULT       8965
1        ATTRIBUTED_TO       1828
2         ACTIVATED_ON       1793
3            HAS_SKILL       1559
4          FOR_PRODUCT       1382
5             ASSESSES        960
6   FOR_PURCHASE_ORDER        674
7            FOR_BRAND        600
8        HAS_OBJECTIVE        600
9          IN_CATEGORY        480
10       FROM_SUPPLIER        480
11            WORKS_IN        200
12          LOCATED_IN        200
13          REPORTS_TO        189
14     PARENT_CATEGORY        121
15      SUB_CHANNEL_OF          4

### All Node Labels

In [6]:
query = """
CALL db.labels();
"""

result = run_query(query)
print("All node labels in the database:")
result

All node labels in the database:

                 label
0             Employee
1           Department
2             Location
3                Skill
4    MarketingCampaign
5                Brand
6   MarketingObjective
7     MarketingChannel
8         MarketingKPI
9        CommerceOrder
10            Supplier
11            Contract
12       PurchaseOrder
13   PurchaseOrderLine
14        SupplierRisk
15             Product
16             Invoice
17     ProductCategory

### All Relationship Types

In [7]:
query = """
CALL db.relationshipTypes();
"""

result = run_query(query)
print("All relationship types in the database:")
result

All relationship types in the database:

      relationshipType
0             WORKS_IN
1           LOCATED_IN
2           REPORTS_TO
3            HAS_SKILL
4       SUB_CHANNEL_OF
5            FOR_BRAND
6        HAS_OBJECTIVE
7         ACTIVATED_ON
8           KPI_RESULT
9        ATTRIBUTED_TO
10         IN_CATEGORY
11     PARENT_CATEGORY
12            ASSESSES
13       FROM_SUPPLIER
14         FOR_PRODUCT
15  FOR_PURCHASE_ORDER

## 2. HR Domain Queries

### Employees by Department

In [8]:
query = """
MATCH (d:Department)<-[:WORKS_IN]-(e:Employee) 
RETURN d.name AS dept, count(DISTINCT e) AS employees 
ORDER BY employees DESC;
"""

result = run_query(query)
print("Employees by department:")
result

Employees by department:

          dept  employees
0        Sales         70
1    Marketing         70
2  Engineering         60

### All Departments

In [9]:
query = """
MATCH (d:Department) 
RETURN d.name AS dept_name, count(*) AS cnt 
ORDER BY dept_name;
"""

result = run_query(query)
print("All departments:")
result

All departments:

     dept_name  cnt
0  Engineering    1
1    Marketing    1
2        Sales    1

### Most Common Skills Across All Departments

In [10]:
query = """
MATCH (d:Department)<-[:WORKS_IN]-(e:Employee)-[:HAS_SKILL]->(s:Skill) 
WHERE d.name IN ["HR", "Marketing", "Procurement"] 
RETURN s.name AS skill_name, s.category AS category, count(DISTINCT e) AS employee_count 
ORDER BY employee_count DESC 
LIMIT 20;
"""

result = run_query(query)
print("Most common skills across HR, Marketing, and Procurement:")
result

Most common skills across HR, Marketing, and Procurement:

            skill_name    category  employee_count
0              SEO/SEM      Domain              53
1     Content Strategy      Domain              53
2                Excel        Tool              52
3      Public Speaking  Soft Skill              52
4              English    Language              52
5        Communication  Soft Skill              51
6      Time Management  Soft Skill              51
7    Digital Marketing      Domain              50
8   Project Management  Soft Skill              31
9            Mentoring  Soft Skill              29
10          Leadership  Soft Skill              27
11            Japanese    Language               7
12              German    Language               7
13             Spanish    Language               5
14              French    Language               4
15            Mandarin    Language               3

### Top 10 Employees by Skill Count

In [11]:
query = """
MATCH (e:Employee)-[:HAS_SKILL]->(s:Skill)
WITH e, count(s) AS skill_count
RETURN e.first_name + ' ' + e.last_name AS employee_name, 
       e.job_title AS job_title,
       skill_count
ORDER BY skill_count DESC
LIMIT 10;
"""

result = run_query(query)
print("Top 10 employees by number of skills:")
result

Top 10 employees by number of skills:

     employee_name                     job_title  skill_count
0   Alexis Swanson             Software Engineer           12
1    Jenna Watkins                Staff Engineer           12
2       Lisa Allen             Software Engineer           12
3    Connie Massey           Engineering Manager           12
4  Donald Morrison                   QA Engineer           12
5    Patrick Clark           Engineering Manager           12
6     Teresa Jones               DevOps Engineer           12
7    Lauren Pierce             Software Engineer           12
8         Gary Liu             Software Engineer           12
9       Susan Diaz  Business Development Manager           12

## 3. Marketing Domain Queries

### Campaign Performance Overview

In [12]:
query = """
MATCH (c:MarketingCampaign)
OPTIONAL MATCH (o:CommerceOrder)-[:ATTRIBUTED_TO]->(c)
WITH c, count(o) AS order_count, sum(o.total_value) AS total_revenue
RETURN c.name AS campaign_name,
       c.budget AS budget,
       order_count,
       coalesce(total_revenue, 0) AS total_revenue,
       c.start_date AS start_date,
       c.end_date AS end_date
ORDER BY total_revenue DESC
LIMIT 10;
"""

result = run_query(query)
print("Top 10 campaigns by revenue:")
result

Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: total_value)} {position: line: 4, column: 40, offset: 123} for query: '\nMATCH (c:MarketingCampaign)\nOPTIONAL MATCH (o:CommerceOrder)-[:ATTRIBUTED_TO]->(c)\nWITH c, count(o) AS order_count, sum(o.total_value) AS total_revenue\nRETURN c.name AS campaign_name,\n       c.budget AS budget,\n       order_count,\n       coalesce(total_revenue, 0) AS total_revenue,\n       c.start_date AS start_date,\n       c.end_date AS end_date\nORDER BY total_revenue DESC\nLIMIT 10;\n'

Top 10 campaigns by revenue:

,campaign_name,budget,order_count,total_revenue,start_date,end_date
0,User-centric even-keeled encryption,179471.0,4,0,2025-01-21,2025-03-21
1,Face-to-face client-driven support,143143.0,2,0,2025-01-31,2025-03-05
2,Customer-focused systematic support,225691.0,2,0,2025-03-31,2025-06-15
3,Quality-focused background parallelism,176787.0,4,0,2025-01-05,2025-03-29
4,Optimized 5thgeneration algorithm,186450.0,2,0,2025-03-14,2025-05-02
5,Cross-group didactic emulation,188992.0,3,0,2025-03-11,2025-05-09
6,Profit-focused real-time algorithm,93653.0,4,0,2025-04-06,2025-06-09
7,Realigned dedicated structure,168184.0,2,0,2025-03-27,2025-05-20
8,Streamlined tangible moratorium,130886.0,4,0,2025-02-06,2025-03-14
9,Sharable bifurcated algorithm,137314.0,3,0,2025-01-04,2025-02-08

### Marketing Channels Usage

In [13]:
query = """
MATCH (ch:MarketingChannel)<-[:ACTIVATED_ON]-(c:MarketingCampaign)
RETURN ch.name AS channel_name,
       ch.type AS channel_type,
       count(DISTINCT c) AS campaign_count
ORDER BY campaign_count DESC;
"""

result = run_query(query)
print("Marketing channels by campaign usage:")
result

Marketing channels by campaign usage:

           channel_name channel_type  campaign_count
0           Paid Search       Search             270
1          Online Video      Display             269
2  Programmatic Display      Display             257
3                Retail       Retail             253
4      Public Relations           PR             249
5                 Email        Email             248
6                Social       Social             247

### Brand Campaign Distribution

In [14]:
query = """
MATCH (b:Brand)<-[:FOR_BRAND]-(c:MarketingCampaign)
RETURN b.name AS brand_name,
       count(c) AS campaign_count,
       sum(c.budget) AS total_budget
ORDER BY campaign_count DESC;
"""

result = run_query(query)
print("Campaigns and budgets by brand:")
result

Campaigns and budgets by brand:

       brand_name  campaign_count  total_budget
0    Fjord Living              68    11289567.0
1      VelvetLane              67    11560014.0
2  Luma Cosmetics              63    10490666.0
3     Atlas Groom              63     9856966.0
4     Aurora Hair              61     9573802.0
5       PulseSkin              58     9520829.0
6        VitaCore              57     9197230.0
7        DermaLab              56     9653936.0
8    Noir Essence              54     8824554.0
9   Pure Botanics              53     9153691.0

### Campaign Objectives

In [15]:
query = """
MATCH (o:MarketingObjective)<-[:HAS_OBJECTIVE]-(c:MarketingCampaign)
RETURN o.name AS objective,
       count(c) AS campaign_count,
       sum(c.budget) AS total_budget
ORDER BY campaign_count DESC;
"""

result = run_query(query)
print("Campaigns by objective:")
result

Campaigns by objective:

              objective  campaign_count  total_budget
0             Retention             144    23959651.0
1        Product Launch             123    20537548.0
2       Brand Awareness             115    19783668.0
3    E-commerce Revenue             112    17334820.0
4  Customer Acquisition             106    17505568.0

### Top KPI Results

In [16]:
query = """
MATCH (c:MarketingCampaign)-[r:KPI_RESULT]->(k:MarketingKPI)
RETURN k.name AS kpi_name,
       k.unit AS unit,
       count(r) AS measurement_count,
       avg(r.actual_value) AS avg_value,
       max(r.actual_value) AS max_value
ORDER BY measurement_count DESC
LIMIT 10;
"""

result = run_query(query)
print("Top 10 KPIs by measurement count:")
result

Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: actual_value)} {position: line: 6, column: 14, offset: 163} for query: '\nMATCH (c:MarketingCampaign)-[r:KPI_RESULT]->(k:MarketingKPI)\nRETURN k.name AS kpi_name,\n       k.unit AS unit,\n       count(r) AS measurement_count,\n       avg(r.actual_value) AS avg_value,\n       max(r.actual_value) AS max_value\nORDER BY measurement_count DESC\nLIMIT 10;\n'
Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: actual_value)} {position: line: 7, column: 14, offset: 204} for query: '\nMATCH (c:MarketingCampaign)-[r:KPI_RESULT]->(k:MarketingKPI)\nRETURN k.name AS kpi_name,\n       k.unit AS unit,\n       count(r) AS measurement_count,\n       avg(r.actual_value) AS avg_value,\n       max(r.actual_value) AS max_value\nORDER BY measurement_count DESC\nLIMIT 10;\n'

Top 10 KPIs by measurement count:

               kpi_name      unit  measurement_count avg_value max_value
0    Click Through Rate     Ratio               1793      None      None
1       Conversion Rate     Ratio               1793      None      None
2    Return On Ad Spend  Currency               1793      None      None
3           Impressions     Count               1793      None      None
4  Cost Per Acquisition  Currency               1793      None      None

## 4. Procurement Domain Queries

### Supplier Overview

In [17]:
query = """
MATCH (s:Supplier)
OPTIONAL MATCH (s)-[:HAS_CONTRACT]->(c:Contract)
OPTIONAL MATCH (s)-[:PLACED_ORDER]->(po:PurchaseOrder)-[:HAS_LINE]->(line:PurchaseOrderLine)
WITH s,
     count(DISTINCT c) AS contract_count,
     count(DISTINCT po) AS purchase_order_count,
     sum(line.quantity * line.unit_price) AS total_spend
RETURN s.name AS supplier_name,
       s.tier AS tier,
       s.country AS country,
       contract_count,
       purchase_order_count,
       coalesce(total_spend, 0) AS total_spend
ORDER BY total_spend DESC
LIMIT 15;
"""

result = run_query(query)
print("Top 15 suppliers by total spend:")
result

Top 15 suppliers by total spend:

,supplier_name,tier,country,contract_count,purchase_order_count,total_spend
0,None,None,Germany,0,0,0
1,None,None,Venezuela,0,0,0
2,None,None,Germany,0,0,0
3,None,None,Finland,0,0,0
4,None,None,Germany,0,0,0
5,None,None,Germany,0,0,0
6,None,None,Venezuela,0,0,0
7,None,None,Germany,0,0,0
8,None,None,Morocco,0,0,0
9,None,None,Germany,0,0,0
10,None,None,Germany,0,0,0
11,None,None,Slovenia,0,0,0
12,None,None,India,0,0,0
13,None,None,Belgium,0,0,0
14,None,None,Belgium,0,0,0

### High-Risk Suppliers

In [18]:
query = """
MATCH (s:Supplier)-[:HAS_RISK]->(r:SupplierRisk)
WHERE r.score >= 70
RETURN s.name AS supplier_name,
       s.tier AS tier,
       r.category AS risk_category,
       r.score AS risk_score,
       r.assessed_date AS assessed_date,
       r.notes AS notes
ORDER BY r.score DESC;
"""

result = run_query(query)
print("High-risk suppliers (risk score >= 70):")
result

High-risk suppliers (risk score >= 70):

Empty DataFrame
Columns: []
Index: []

### Supplier Risk Summary by Category

In [19]:
query = """
MATCH (s:Supplier)-[:HAS_RISK]->(r:SupplierRisk)
RETURN r.category AS risk_category,
       count(DISTINCT s) AS supplier_count,
       avg(r.score) AS avg_score,
       max(r.score) AS max_score
ORDER BY avg_score DESC;
"""

result = run_query(query)
print("Supplier risk summary by category:")
result

Supplier risk summary by category:

Empty DataFrame
Columns: []
Index: []

### Purchase Order Summary

In [20]:
query = """
MATCH (po:PurchaseOrder)-[:HAS_LINE]->(line:PurchaseOrderLine)
WITH po, sum(line.quantity * line.unit_price) AS po_total
RETURN po.status AS status,
       count(po) AS order_count,
       sum(po_total) AS total_amount,
       avg(po_total) AS avg_amount
ORDER BY order_count DESC;
"""

result = run_query(query)
print("Purchase orders by status:")
result

Purchase orders by status:

Empty DataFrame
Columns: []
Index: []

### Active Contracts Summary

In [21]:
query = """
MATCH (s:Supplier)-[:HAS_CONTRACT]->(c:Contract)
WHERE c.end_date IS NULL OR c.end_date >= date()
RETURN s.name AS supplier_name,
       c.contract_id AS contract_id,
       c.category AS category,
       c.value AS contract_value,
       c.currency AS currency,
       c.start_date AS start_date,
       c.end_date AS end_date
ORDER BY c.value DESC
LIMIT 20;
"""

result = run_query(query)
print("Top 20 active contracts by value:")
result

Top 20 active contracts by value:

Empty DataFrame
Columns: []
Index: []

### Purchase Order Lines by Product Category

In [22]:
query = """
MATCH (line:PurchaseOrderLine)
RETURN line.product_category AS product_category,
       count(line) AS line_count,
       sum(line.quantity) AS total_quantity,
       sum(line.quantity * line.unit_price) AS total_value,
       avg(line.unit_price) AS avg_unit_price
ORDER BY total_value DESC
LIMIT 15;
"""

result = run_query(query)
print("Top 15 product categories by spend:")
result

Top 15 product categories by spend:

Empty DataFrame
Columns: []
Index: []

## 5. Cross-Domain Analytics

### Department-Brand Connections

In [23]:
# Find connections between departments and brands through employees and campaigns
query = """
MATCH (d:Department)<-[:WORKS_IN]-(e:Employee)
WHERE d.name IN ['Marketing', 'HR', 'Procurement']
WITH d, count(e) AS employee_count
OPTIONAL MATCH (d)<-[:WORKS_IN]-(e2:Employee)-[*1..2]-(b:Brand)
RETURN d.name AS department,
       employee_count,
       count(DISTINCT b) AS connected_brands
ORDER BY connected_brands DESC;
"""

result = run_query(query)
print("Department connections to brands:")
result

Department connections to brands:

  department  employee_count  connected_brands
0  Marketing              70                 0

### Supplier Contract Product Categories

In [24]:
# Check product categories across suppliers
query = """
MATCH (s:Supplier)-[:PLACED_ORDER]->(po:PurchaseOrder)-[:HAS_LINE]->(line:PurchaseOrderLine)
WITH s, collect(DISTINCT line.product_category) AS categories, count(DISTINCT po) AS order_count
RETURN s.name AS supplier_name,
       s.tier AS tier,
       size(categories) AS category_count,
       categories,
       order_count
ORDER BY category_count DESC
LIMIT 10;
"""

result = run_query(query)
print("Top suppliers by product category diversity:")
result

Top suppliers by product category diversity:

Empty DataFrame
Columns: []
Index: []

## 6. 3D Graph Visualization

### Export Graph Data for 3D Visualization

In [25]:
# Export nodes and links for 3D visualization
import json
from datetime import datetime, date

def serialize_neo4j_types(obj):
    """Convert Neo4j types to JSON-serializable formats"""
    if hasattr(obj, 'isoformat'):  # datetime, date, time
        return obj.isoformat()
    elif isinstance(obj, dict):
        return {k: serialize_neo4j_types(v) for k, v in obj.items()}
    elif isinstance(obj, list):
        return [serialize_neo4j_types(item) for item in obj]
    else:
        return obj

query = """
MATCH (n)
OPTIONAL MATCH (n)-[r]->(m)
WITH
  collect(DISTINCT { 
    id: elementId(n), 
    label: head(labels(n)), 
    name: coalesce(n.name, n.first_name, n.employee_id, n.campaign_id, n.supplier_id, ''),
    props: properties(n) 
  }) AS nodes,
  collect(DISTINCT { 
    source: elementId(n), 
    target: elementId(m), 
    type: type(r), 
    props: properties(r) 
  }) AS links
RETURN { nodes: nodes, links: links } AS graph;
"""

print("Fetching graph data from Neo4j...")
with driver.session() as session:
    result = session.run(query)
    graph_data = result.single()['graph']

# Remove null links (from OPTIONAL MATCH where no relationship exists)
graph_data['links'] = [link for link in graph_data['links'] if link['target'] is not None]

# Serialize Neo4j types to JSON-compatible format
graph_data = serialize_neo4j_types(graph_data)

print(f"✓ Exported {len(graph_data['nodes']):,} nodes")
print(f"✓ Exported {len(graph_data['links']):,} relationships")

# Save to JSON file
output_path = os.path.join(project_root, 'notebooks', 'graph.json')
with open(output_path, 'w') as f:
    json.dump(graph_data, f, indent=2)

print(f"✓ Saved to {output_path}")

Fetching graph data from Neo4j...
✓ Exported 5,310 nodes
✓ Exported 20,035 relationships
✓ Saved to /Users/ivan/FSFM/01_Courses/Coop/Helixgraph/HEL-20/HelixGraph/notebooks/graph.json

### Generate 3D Visualization HTML

In [26]:
# Generate HTML file for 3D visualization with embedded data
import json

# Read the graph data
graph_json_path = os.path.join(project_root, 'notebooks', 'graph.json')
with open(graph_json_path, 'r') as f:
    graph_data_embedded = json.load(f)

# Convert to JavaScript variable
graph_data_js = json.dumps(graph_data_embedded)

html_content = f'''<!doctype html>
<html>
<head>
  <meta charset="utf-8" />
  <title>HelixGraph 3D Visualization - All Departments</title>
  <style>
    html, body {{ height: 100%; margin: 0; font-family: Arial, sans-serif; }}
    #3d-graph {{ width: 100%; height: 100vh; display:block; }}
    .info {{ 
      position: absolute; 
      left: 10px; 
      top: 10px; 
      color: #fff; 
      z-index:100; 
      background: rgba(0,0,0,0.7); 
      padding:10px 15px; 
      border-radius:8px; 
      font-size: 14px;
      line-height: 1.6;
    }}
    .stats {{
      position: absolute;
      right: 10px;
      top: 10px;
      color: #fff;
      z-index: 100;
      background: rgba(0,0,0,0.7);
      padding: 10px 15px;
      border-radius: 8px;
      font-size: 12px;
    }}
    .legend {{
      position: absolute;
      left: 10px;
      bottom: 10px;
      color: #fff;
      z-index: 100;
      background: rgba(0,0,0,0.7);
      padding: 10px 15px;
      border-radius: 8px;
      font-size: 11px;
      max-height: 300px;
      overflow-y: auto;
    }}
    .legend-item {{
      display: flex;
      align-items: center;
      margin: 4px 0;
    }}
    .legend-color {{
      width: 12px;
      height: 12px;
      border-radius: 50%;
      margin-right: 8px;
    }}
  </style>
</head>
<body>
  <div id="3d-graph"></div>
  <div class="info">
    <strong>HelixGraph 3D Visualization</strong><br>
    🖱️ Drag to rotate<br>
    📜 Scroll to zoom<br>
    🎯 Click node to center
  </div>
  <div class="stats" id="stats">Loading...</div>
  <div class="legend" id="legend"></div>

  <!-- 3D Force Graph (from unpkg CDN) -->
  <script src="https://unpkg.com/three@0.152.2/build/three.min.js"></script>
  <script src="https://unpkg.com/3d-force-graph"></script>

  <script>
    // Embedded graph data (no external file needed - CORS safe)
    const data = {graph_data_js};
    
    console.log('Loaded embedded graph data');
    console.log('Nodes:', data.nodes.length, 'Links:', data.links.length);
    
    // Calculate statistics
    const nodeCounts = {{}};
    data.nodes.forEach(node => {{
      nodeCounts[node.label] = (nodeCounts[node.label] || 0) + 1;
    }});
    
    const linkCounts = {{}};
    data.links.forEach(link => {{
      linkCounts[link.type] = (linkCounts[link.type] || 0) + 1;
    }});
    
    // Display statistics
    const statsDiv = document.getElementById('stats');
    statsDiv.innerHTML = '<strong>Graph Statistics</strong><br>' +
      `Nodes: ${{data.nodes.length.toLocaleString()}}<br>` +
      `Links: ${{data.links.length.toLocaleString()}}`;
    
    // Create legend
    const legendDiv = document.getElementById('legend');
    legendDiv.innerHTML = '<strong>Node Types</strong><br>';
    
    // Initialize graph
    const Graph = ForceGraph3D()
      (document.getElementById('3d-graph'))
      .graphData(data)
      .nodeAutoColorBy('label')
      .nodeLabel(node => {{
        const name = node.name || node.id;
        return `${{node.label}}: ${{name}}`;
      }})
      .linkDirectionalParticles(1)
      .linkDirectionalParticleSpeed(0.008)
      .linkWidth(link => 0.5)
      .linkOpacity(0.3)
      .nodeThreeObject(node => {{
        // Different sizes for different node types
        let size = 2;
        if (node.label === 'Department') size = 8;
        else if (node.label === 'Employee') size = 3;
        else if (node.label === 'Supplier') size = 5;
        else if (node.label === 'MarketingCampaign') size = 4;
        else if (node.label === 'Brand') size = 6;
        
        const obj = new THREE.Mesh(
          new THREE.SphereGeometry(size),
          new THREE.MeshLambertMaterial({{ 
            color: node.__color,
            transparent: true,
            opacity: 0.85
          }})
        );
        return obj;
      }})
      .onNodeClick(node => {{
        // Center camera on node
        const distance = 120;
        const distRatio = 1 + distance / Math.hypot(node.x, node.y, node.z);
        Graph.cameraPosition(
          {{ 
            x: node.x * distRatio, 
            y: node.y * distRatio, 
            z: node.z * distRatio 
          }},
          node,
          1500
        );
        console.log('Clicked node:', node);
      }})
      .onNodeHover(node => {{
        document.body.style.cursor = node ? 'pointer' : 'default';
      }});
    
    // Populate legend with node colors
    setTimeout(() => {{
      const colorMap = {{}};
      data.nodes.forEach(node => {{
        if (!colorMap[node.label]) {{
          colorMap[node.label] = node.__color;
        }}
      }});
      
      Object.entries(nodeCounts).sort((a, b) => b[1] - a[1]).forEach(([label, count]) => {{
        const color = colorMap[label] || '#999';
        legendDiv.innerHTML += `
          <div class="legend-item">
            <div class="legend-color" style="background-color: ${{color}}"></div>
            <span>${{label}} (${{count.toLocaleString()}})</span>
          </div>
        `;
      }});
    }}, 500);
    
    // Initial zoom to fit
    Graph.zoomToFit(800);
  </script>
</body>
</html>
'''

# Save HTML file
html_path = os.path.join(project_root, 'notebooks', 'graph_3d.html')
with open(html_path, 'w', encoding='utf-8') as f:
    f.write(html_content)

print(f"✓ Generated 3D visualization HTML with embedded data")
print(f"✓ Saved to {html_path}")
print(f"✓ File size: {len(html_content):,} bytes")
print("\n📊 To view the 3D graph:")
print(f"   Open {html_path} in your browser")
print("   (No CORS issues - data is embedded in HTML)")

✓ Generated 3D visualization HTML with embedded data
✓ Saved to /Users/ivan/FSFM/01_Courses/Coop/Helixgraph/HEL-20/HelixGraph/notebooks/graph_3d.html
✓ File size: 7,848,593 bytes

📊 To view the 3D graph:
   Open /Users/ivan/FSFM/01_Courses/Coop/Helixgraph/HEL-20/HelixGraph/notebooks/graph_3d.html in your browser
   (No CORS issues - data is embedded in HTML)

### View in Jupyter (Inline)

You can also view the 3D graph inline in Jupyter using an IFrame:

In [27]:
from IPython.display import IFrame

# Display the 3D visualization inline
IFrame(src='graph_3d.html', width=1000, height=700)

## Cleanup

In [28]:
# Close the driver connection
# Note: Commented out to allow running cells multiple times in the notebook
# Uncomment if this is your final operation
# driver.close()
# print("✓ Connection closed")

print("ℹ️  Driver still active (allows re-running cells)")
print("   Run driver.close() manually when completely done")

ℹ️  Driver still active (allows re-running cells)
   Run driver.close() manually when completely done